# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.15-s080_1 on Tue Sep 02 13:58:35 UTC 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design aes_128

set_clock_gating_check -setup 0.0 
